Revit 2024 API
RebarCoupler.CouplerMark Property
 gets and sets the coupler mark
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public string CouplerMark { get; set; }
Visual Basic
Public Property CouplerMark As String
	Get
	Set
Visual C++
public:
property String^ CouplerMark {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace